/* Localized versions of strings used in the QuartzComposer UI */

PortEditing_True = "True";
PortEditing_False = "False";

PortTooltip_Name = "Name";
PortTooltip_Description = "Description";
PortTooltip_Type = "Type";
PortTooltip_PublishedName = "Published Name";
PortTooltip_PublishedKey = "Published Key";
PortTooltip_Value = "Value";
PortTooltip_RGBA = "RGBA";
PortTooltip_Dimensions = "Dimensions";
PortTooltip_UndefinedDimensions = "Infinite (needs cropping to render)";
PortTooltip_Target = "Texture Target";
PortTooltip_ID = "Texture ID";
PortTooltip_Source = "Source";
PortTooltip_AspectRatio = "Aspect Ratio";
PortTooltip_Members = "Member(s)";

PatchTooltip_Name = "Name";
PatchTooltip_Category = "Category";
PatchTooltip_Key = "Key";
PatchTooltip_ActiveCount = "Activation Count";

Inspector_SettingsTitle = "Settings";
Inspector_InputsTitle = "Input Parameters";

PatchMenu_EditMacro = "Edit Macro Patch...";
PatchMenu_Timebase = "Timebase";
PatchMenu_Parent = "Parent";
PatchMenu_Local = "Local";
PatchMenu_External = "External";
PatchMenu_RenderingLayer = "Rendering Layer";
PatchMenu_Layer = "Layer";
PatchMenu_AddMacro = "Create Macro Patch";
PatchMenu_CreateMacro = "Create Macro Patch With Selection";
PatchMenu_EditParent = "Edit Parent Patch...";

ManagerView_Category = "Category";
ManagerView_Name = "Name";

ParametersView_NotEditable = "<%@ not editable>";

QCVirtualPort = "Virtual";

QCBooleanPort = "Boolean";
QCIndexPort = "Index";
QCNumberPort = "Number";
QCStringPort = "String";
QCColorPort = "Color";

QCObjectPort = "Object";
QCStructurePort = "Structure";
QCGLImagePort = "Image";
